#language: ru
@calculator @division

Функция: Деление

  Структура сценария: Деление различных чисел
    Пусть первый аргумент равен <аргумент1>
    Пусть второй аргумент равен <аргумент2>
    Когда выполнена операция деления
    Тогда результат равен <результат>
    Примеры:
      | аргумент1 | аргумент2 | результат |
      | 2.0       | 2.0       | 1.0       |
      | 2.0       | -1.0      | -2.0      |
      | 1.0       | 1.0       | 1.0       |
      | 0.0       | 1.0       | 0.0       |
      | 10.0      | 2.0       | 5.0       |
      | -0.1      | 5.0       | -0.02     |
      | 12.0      | -1.0      | -12.0     |
      | 0.1       | 0.1       | 1.0       |
      | 100.0     | 2.0       | 50.0      |
      | 25.0      | -5.0      | -5.0      |
      | -128.0    | 4.0       | -32.0     |


