#language: ru
@calculator @multiplication

Функция: Умножение

  Структура сценария: Умножение различных чисел
    Пусть первый аргумент равен <аргумент1>
    Пусть второй аргумент равен <аргумент2>
    Когда выполнена операция умножения
    Тогда результат равен <результат>
    Примеры:
      | аргумент1 | аргумент2 | результат |
      | 0.0       | 0.0       | 0.0       |
      | 2.0       | -1.0      | -2.0      |
      | 1.0       | 0.0       | 0.0       |
      | 0.0       | 1.0       | 0.0       |
      | 10.0      | 3.0       | 30.0      |
      | -0.1      | 5.0       | -0.5      |
      | 12.0      | -1.0      | -12.0     |
      | 0.1       | 0.0       | 0.0       |
      | 100.0     | 2.1       | 210.0     |
      | 5.0       | -5.0      | -25.0     |
      | -2.0      | 6.3       | -12.6     |

